[["Каким должен бть мобальный сайт?","Каким же должен быть мобальный сайт?\r\nСамый главный секрет хранящий в себе скрытые тайны “мобального сайта”, сначала может быть не совсем ясен. Но, на самом деле: не нужно ходть к гадалками и ученым с ренТв; не надо иметь высоченной высшее образование с доказательством что оно на пол шишки выше, чем у всех остальных. Достаточно знать простую истину что мобальный сайт, должен открываться на мобильном, так чтобы контент был: удобочитаем, хорошо виден, а интерфейс интуитивно понятен. Все!\r\n\r\nКак говорит народная поговорка: “Сайт мобальный, продажник шикарный!”.\r\n\r\nКонтент на мобильном сайте легче всего подгружать с помощью ноды, аяксом на голом фронтенде и даже генерируемый на джейэсе с помощью якорных ссылок для опознавания снаружи. Всего что находится в странице.\r\n\r\nВ данном примере “мобальный” сайт пишется на голом фронтенде, потому что так легче написать полностью отзывчивую страничку с помощью великой троицы веб технологий: html css js. А контент появляется нажатием кнопки и запуска xmlHttpRequest - точечной подгрузкой.\r\n"],["Веб мастерская\r\n","Веб мастерская\r\nНаша миссия: писать “программировать” сайты и лендинги на JS +(версткой) с помощью флексов, временами дополненных гридами. Обязательно современными тегами из области html5.\r\n\r\nИ обязательно с продвижением в контекстной рекламе(если есть средства на что).\r\n\r\nИз всех возможных технологий “по программированию лендинга” в веб мастерской имени Барона Сайтоверстаузена, наибольшему предпочтению отадется яваскрипту(“джейэсу” JS). Из за простоты, многофункциональности и удобстве применения. Да. И стоит откровенно признаться в большей степени потому что это единственный язык программирования работающий в браузере, доступный любому персонажу, независимо от разнообразных факторов(...и даже самых форсМажорных). Сколько бы не было желаний программировать на чем либо еще. В силу вышеизложенных “непреодолимых” факторов, приходится возвращаться к яваскрипту. Пусть даже все сопоставления можно сравнить как “спиди гонщик” психанув, случайно, заехал в кювет. И осознавая всю плачевность ситуации, продолжает дальше её осознавать. Недоумевая в трезвонящей паники. Для любой форсМажорной авиакатастрофы, необходимы только эти три фактора: кювет, браузер и яваскрипт!\r\n\r\nДаже когда ученые с ренТв, не пытались прокомментировать происходящее. Все изложенные факты из телепередачи: “необъяснимо но факт”. Фрактально констатируют: “кювет, браузер и яваскрипт!”.\r\n\r\n\r\nSpeed\r\nСайт заточен “скоростить”. Несмотря ни на что, сайт наяривает запредельные скорости. Так быстро, что говоря: “а что это было?”. Первым делом можно сразу же выставить цепочку предположений, что это все Барон Сайтоверстаузен, опять заскоростил. И как говорил один человек: “никогда такого не было и вот, опять”.\r\n\r\n\r\nКомментарии которые оставляют настоящие люди. Настоящие люди - это те люди которых можно охарактеризовать: “человеком” независимо от пола и возраста, либо каких либо еще классификаций, сегментирующие индивидуума по отличительным чертам, свойственных дозволенной уникальности в рамках одного вида. <span style=”font-size:55px;>?<\/span>\r\n\r\nКриво косо с ошибками, как полагается интерпретировать порыв вдохновения из тонкой глубины искренних чувств. И совсем не идеально. \r\n"],["Космодолбыш Укосмопоротое преключение!","Космодолбыш - укосмопоротое признание загадочной правды(разведанной и прощупанной). Эта правда сопоставима с невероятной схожей аналогией горячечного бреда. Но в все же, все сходится с правдой. О_о … , а как Вы хотели! -Это ведь даже не вопрос, а утверждение! \r\n\r\nКак говорят программисты с прагматической схемой мышления. Можно спокойно писать код с фоновой трансляцией телевизора. И в самом деле, код который пишется на уровне поверхностного выполнения. Можно писать в буйной агонии рабочего процесса. А что же делать если в задуманной абстракции несколько уровней погружения с зависимостью взаимодействий. Как в фильме “начало”, погружаться в несколько снов чтобы прощупать что же там происходит на самом деле.\r\nТогда то и любая отвлекающая мелочь пробуждает дикого зверя вырваться на сокрушительную битву в разрывающей ненависти. Неутолимой жаждой свежей крови.\r\n\r\nА мы легких путей не ищем. И тоже можем работать как все “нормальные” люди. С полным комплектом: нагоняев, гибкой системой штрафов, низкой зарплатой, долгами и исчо какой нибудь коммунистический вакханалией для полного безумия. Решая так давно измученную проблему: “кто же все таки, кому будет платить?”.\r\n\r\nНадо быть готовым, надо закаляться! Первым делом работу с фоновым просмотром телепередачи с ютуба. И как всегда непревзойденное везение вполне возможно списать на тайное присутствие инопланетян. До утверждения далековато, но о возможной закономерности фактов. Можно догадаться. Под шумок телепередачи: “необъяснимо но факт”. И в этот самый раз опять не обошлось без ученых с ренТв. Все похоже на то. Как будто инопланетяне стали воздействовать не на содержимое внутри черепной коробки, а на новейшую технологию 21 века: “компутер(с интернетом)”. Как то случайно, всеми известными, учеными с ренТв. Заряжали на полном серьезе про планету обезьян, где то в бескрайнем далеком космосе. С высоченной, высшей технологией истинных, светлых кровей. Светлой расой. Господствующей над другими расами. И тем подтверждением была видеозапись на которой Индус преподнес “подношение” высшему культурному индивидууму из банды обезьян. Мол это все заложено памятью природы, почитать своих прародителей. В давнишним господствующей на нашей грешной планеты, когда то развитой и высоко процветающей “планетой обезьян”.\r\nВ то время как Инус подшучивал над бедными и голодными обезьянками. Все было переконвертировано в “подношение” высшей расе.\r\n\r\nВ такие моменты самым непредвиденным образом. Может случится: “начало”..., начинает экзестенцианироваться страшный гипертрофированный, смехадзилический приступ. О_о ученые с ренТв, Вы такие умные… и под шумок весеннего обострения разными гениальным способами маскирующие Смехадзиллу. Может и удается конвертировать её в хихиХантра. Но, эта таже самая Смехадзила крадущаяся на цыпочках. Чтобы напасть на тебя и подставить в самый неожиданный момент. И вот классификация распределяется под тайным грифом: “полный неадекват”. Практически полностью сформированный. Зато уже уверенно крепко держащийся на ногах, в полный весь свой рост, невероятный. Персонаж.\r\n\r\nПод вечер этот же цикл сказочных фактов заменил, завершать равноценный ужас. В крадущийся безумной паникой. Смехадзилла тут же применяет своё новомодное кун-фу, бросая дымовую бомбу себе в ноги. Растворяясь по удаляющемуся в горизонт ветру… ХихиХантр оседлавший удивляющегося гуся, уже во всю нашлепывает смешными лапами в противоположную сторону… Все последние смешки разлетаются как осколки от упавшей на неё необъяснимой но фактовой телепередачей. Зафиксировавшей на камеру персонажа, в полном разгаре интерпритации порыва вдохновения. Во всей красе, высоко раздутой великолепной шикарности. Завышенной за бугром настолько, что даже и бугра уже не видно… Но что можно было наплести? Что оператор заметив, сразу принялся восклицать: “О_о высоко, уважаемый, великий персонаж. Вы так шикарно преподнесли Нам материал! А… Давайте, еще раз! На бис!...”.\r\n"],["Шо такое быть героем","<p>Быть Героем- это значит писать чистый понятный код. Понятный даже таким же персонажем, подозревающих себя в геройстве(Возможно уже великом).<\/p> \r\n\r\n<p>Тут начинается еще одна великолепная история, которая звучала бы: “Никто кроме нас”. И нас - это уже точно значит героев. Возможно мелкого элемента, но от одной огромной, гигантской машины, с невероятными возможностями. Возможностями геройствовать “на широкую ногу”. Так героически - что до сих пор никто не может поверить. Пополняя фронт утонувших в сомнениях, временами констатируя свое неприличное мнение, грязными восклицаниями: “да, что же это за бред ты несешь!?”<\/p>\r\n<p>\r\nИ даже если грязные ругательства и сквернословия, не вылетают в Наш сказочный мир. То по внешнему виду, видно. Где-то там внутри бушуют раскаты грязного грома, взгляд сверкает злостными молниями, под кружащими тучами ненависти.\r\nВот и все! Остаётся сделать только один вывод: Видимо злым людям невозможно спокойно смотреть на сказочный мир волшебства и бескрайних возможностей. Где ясно, свежо, тепло и солнечно. Для расцветания еще более причудливых фактов. Где единорог кушает радугу, радуется и улыбается смешной улыбкой…. \r\n<\/p>"],["Лендинг с технологией Full stack!","<style>\r\n    img{\r\n      max-width:100%;\r\n    }\r\n<\/style>\r\n    <p style=\"background:rgba(0,255,0,0.3);\">Так и отправка джейсон формата через пиашпи, в голый аштиэмель. С помощью php, который крадется тайком, в полной боевой готовности! … запустить свой сюрикен!<\/p>\r\n  <picture>\r\n          <source srcset=\"\/images\/full-stack-development.webp\" type=\"image\/webp\">\r\n          <img src=\"images\/full-stack-development.png\" alt=\"full-stack-development.png\">\r\n        <\/picture>\r\n<h2>Действенный и удобный способ “full stack” лендинга!<\/h2>\r\n<p>Тянуть из mysql контент с постами через php конвертируя массив в json формат. Оказывается это достаточно легкая и модифицируемая техника. И в силу того что джейэс формат будет отображаться без бекендового языка. Многофункциональную страницу становится возможным сделать на легком html формате. Выполнить перебор объекта, с помощью джейэса. Далее можно с чистой совестью мчаться по дороге в сторону уходящего заката. Оставив за  собой скользящие стоки с титрами…<\/p>\r\n<h2>Вот такие дела!<\/h2>\r\n<p>В итоге имеется многофункциональный лендинг по принципу сингл пейдж апликейшн. Без ноды, без новейшего фреймворка. А сделанный только голыми руками на доступном хостинге, на древней технологии доступной даже программисту начального уровня. (html\/css\/js\/php) и совсем немножко sql. На поверхностном уровне. (Назвать хостинг “дешевым” - можно потому что использование php и sql куда ниже по стоимости чем, хостинг с эсесейч подключением). + PHP идет в комплекте с такой операционкой как убунту. Что легко охарактеризовать как полный ноль расходов и заморочек. (потому что все это поставляется бесплатно).<\/p>\r\n\r\n<p>Может поэтому php продолжает занимать лидирующее место во всем бекенде, ведь даже появление ноды с 2009 года никак не сдвинуло php как основательного топа1.<\/p>\r\n<p>И если взять для примера сайт фрилансеров, то php будет на первом месте. А с тем что с помощью php легко конвертировать любые данный массива в json формат. Затем передать в js в котором все раскроется как распускается цветок под солнечными лучами. PHP можно охарактеризовать как темного ниндзя бесшумно крадущегося тенью где-то в бекенде. А кнопка button с POST запросом как ниндзявский сюрикен прицельно точно попадающий цель.<\/p>\r\n<p style=”background:green; margin:1%;”>Вот такие делА!<\/p>\r\n  <picture>\r\n          <source srcset=\"\/images\/php9.webp\" type=\"image\/webp\">\r\n          <img src=\"images\/php9.png\" alt=\"nindzja-php.png\">\r\n        <\/picture>"],["PHP выборка для передачи в фронтенд через JSON","<p>Нормальные языки программирования работают в одном всем понятном направлении. \r\nА, это, что опять такое: Выборку из базы данный отправить в голый фронтенд! Для специалиста с “высоченно высшим образованием” - HTML CODER!<\/p>\r\n\r\n<h2 style=\"background: rgba(0,255,0,0.5); max-width: 100%; width:900px; color:red; text-shadow: 2px 2px 3px black; text-align: center;\">СТОП! Подождите! Неужели: HTML CODER существует?<\/h2>\r\n<p><span style=”background:rgba(255,0,0,0.3);”>- И, да, еще как существует. -Но, только для тех у кого высшее образование, на пол шишки выше чем у всех остальных “других html coder{ow}”.<\/span><\/h2>\r\n<p>Только чтобы быть html coderom по нашему! Одними тегами не обойтись. Начало пути будет углубленное знание CSS, JS, MySql, фреймворков “тележечка”. И бекенд! Ни один уважающий себя HTML CODER, не может обойтись без бекенда. Хотябы чтоб подклевывать данные из mySql бд. Можно обойтись всеми известным PHP. Хоть и много дискуссий насчет php как основного бекедовского. Но PHP - обсуждается намного чаща и найти любую информаци и разобрать непонятные момент, проще на PHP.<\/p>\r\n<p>Самый хороший и лучший способ был описан в сайте учебного курса. И лучше не тащить всю кучу постов, а конвертировать в json только один точечный пост.<\/p>\r\n<a href=\"https:\/\/www.mousedc.ru\/learning\/65-sql-select-where-like-and-or\/\">https:\/\/www.mousedc.ru\/learning\/65-sql-select-where-like-and-or\/<\/a>\r\n<blockquote cite=”https:\/\/www.mousedc.ru\/learning\/65-sql-select-where-like-and-or\/”>\r\n<p style=\"background:rgba(255,5,0,0.3); text-align:center;\">SELECT * FROM `USERS` WHERE `NAME` LIKE 'Мышь%';<\/p>\r\n<p>В таком случае отображение поста отобразится по имени “NAME”, а если искать по айдишнику, то по этому принципу ‘id’ LIKE ‘%170%’ отобразит строку всей записи в базе с ключом по айдишнику.<\/p>\r\n<\/blockquote>\r\n\r\n<p>Хоть яваскрипт и так справляется на отлично с перебором многомерного массива из объекта переданного с помощью php в формате json. Но если распределить баланс по нагрузке, выйдет что проще делать выборку на сервере. Таким образом кнопка < button> играет роль щупа или пальца которым можно потыкать базу данных через пиашпи и незамедлительно получить горячий отклик через аякс.<\/p>\r\n<a href=..\/voting.html>На один пост с помощью генерации json формата на php и передача данных во фронтенд.<\/a>\r\n<div>\r\n<picture>\r\n  <img src='..\/images\/full-stackDevel.jpg' alt='full stack' style=\"max-width:100%;width:300px;float:left;padding-right:1%;\">\r\n<picture>\r\n\r\n<p>По многим причинам выходит что работать HTML CODER -ом. Это не “хухры, мухры”. А на самом деле html coder! Довольно таки почитаемая специальность, таящая в своих глубинах маленький багаж full-stack разработчика. Да еще и маленькую тележку, фреймворков на javascript. И как полагается надо быть начеку и понимать простую истину: Простого высшего образования не хватит чтобы провозгласить себя: ‘HTML CODER’. Надо быть готовым ко всему и начало будет с того что уже и простыми фреймворками для full-stack ‘HTML CODER’-а одним javascript никак не отделаться! Тут должен быть и очень значимый бекенд.<\/p>\r\n<\/div>\r\n"],["  <h2>PHP работает с JSON<\/h2>","<p>Это уже не новость. Загуглив JSON в php можно наткнуться на видео с февряля 2020 года где пост запросы отлавливаются пиашпишкой невидимой и скрытой техникой. Там не полная схема, но начало уже ясно. Очень просто с помощью html формы, выполнить пост запрос на “тайный” php скриптик, который поковыряетя в BD и вернет в формате json все нужные данные. Таким образом можно шурудить и туда и обратно. Все что угодно. В этом случае пиашпишка остаётся единственной и незаменимой. Все потому что php старый(древний) язык бекенда, поддержывается абсолютно всеми серверами. И как гласит статистика с хабра 79% мирового бекенда...<\/p>\r\n        <div style=\"display:flex; justify-content:center;word-break: break-all;word-wrap: break-word; align-items:center;max-width:100%; flex-direction:column;\">\r\n          <a href=\"https:\/\/habr.com\/ru\/company\/skillbox\/blog\/534684\/\">https:\/\/habr.com\/ru\/company\/skillbox\/blog\/534684\/<\/a>          <picture>\r\n            <source srcset=\"..\/images\/php-first-sp.webp\" type=\"image\/webp\">\r\n            <img src=\"..\/images\/php-first-sp.png\" alt=\"php Статистика бекенда\">\r\n          <\/picture>\r\n        <\/div>\r\n        <p>Пиашпи остается основательным лидером, и все хорошо. Тока! Мы то, люди умные простых путей не ищем. Поэтому если обратить внимание на пейдж спид от гугла. Выйдет что, до полного 100% показателя грин зоны. Остается всегда каких то 3%. Хотя все указания призренно тычат в счетчики аналитики от всемилюбимого яндекса. Но, нам не до яндекса. Ковыряться мы будем в пиашпишки, ибо все равно яндексу ничем не помочь.<\/p>\r\n        <p>Как видно из статистики 1% бекенда отдают javascript! JavaScript - 1,1%;\r\n        Почему же так? Насколько подсказывала логика, а здравый смысл намекал что яваскрипт создан для фронтенда и работает в основном в браузере(или в мабальном браузере). Все как бы становится похожим на то что “командир главнокомандующий с хабра, доказал всем с помощью сурового закона. Что его высшее образование на пол шишки выше чем у всех остальных: верховноОбразованных, но не до конца… Не стоит удивляться: что для устройства на работу “программистом”, в тестовом задании будет условие написать подключение к базе данных на javascript. Но.... Хм… Это как?  На что гугл с уверенным подтверждением заверит: “да это возможно”!<\/p>\r\n\r\n        <p>Так и летит время. Незаметно, недавно взгляд рассматривал утренний интервал, пролетающая секунда как весомый отрезок времени. За одну секунду можно успеть кучу дел! Если учесть что итерации условий циклов, измеряются в миллисекундах. Способные метнуться туда, обратно и обойти предначертанные схемы образных условий. Придуманные с неуклюжей гениальностью в творческом порыве вдохновения. Как было надо, а проследить весь путь что там за мотивация у программы написанной с самыми благими намерениями. Зашедшие в логической схеме на переобход цикла в цикле, чтобы вытащить значение переменной, область видимости которой недоступна всем непосвященным. Как из цикла в цикле? Когда на часах уже вечер, еще немного в таком темпе и будет ночь.<\/p>"],["<h2>И вот какая идея! JSON через PHP<\/h2> ","<picture>\r\n<img src=\"..\/images\/json-and-php.png\" alt=\"json_and_php\">\r\n<\/picture>\r\n<p>Почему PHP лучший способ писать на бекенде? Когда возникла необходимость: немножко попробовать бекенад.\r\nКроме php другого выхода нет. Php по уполномочию на любом линусовском сервере, что и говорит о том что и любой хостинг уже по уполномочию с линуксом. А значит с PHP.<\/p>\r\n<p>Так и начинается погружение в пучину php stack. PHP - единственный самый распространенный язык бекенда. Если сравнить php с node -ой, то главным отличием будет то что php установлен уже везде и пить есть не просит. В случае с нодой. Необходимо эссесейч подключение. Поэтому иногда приходится обращаться к службе поддержки, но и служба поддержки тоже не сможет решить все проблемы. И как бы не все в царских традициях. А, некоторые люди еще и за работу, хотят получать деньги. Или какое либо материальное вознаграждение. Кроме как личного самоудовлетворения.\r\nПотому что в цивилизованном мире-принято, работу чем нибудь оплачивать или соорудить открытую мотивацию в равной распределенности. Иными словами как либо компенсировать время потраченное на выполнение “нужного” дела.<\/p>\r\n\r\n\r\n\r\n<h3>PHP shuriken_thorow<\/h3>\r\n<div>\r\n<style>\r\n.ikartinka{\r\n  max-width: 100%;\r\n  width:300px;\r\n  float:right;\r\n}\r\n@media(max-width:500px){\r\n  .ikartinka{\r\n    width:100%;\r\n  }\r\n}\r\n<\/style>\r\n  <picture>\r\n    <img src=\"..\/images\/P10627-095822.jpg\" alt=\"быстрая работа базы данных на хостинге fozzy\" class=\"ikartinka\">\r\n  <\/picture>\r\n<p>Принцип работы php shuriken_thorow это обычный скрипт на PHP который вытягивает из базы данных на mysql, пост по айдишнику. Это происходит таким образом: PHP на стороне сервера шурудит базу и кидает в фронтенд JSON формат в котором и записан пост. Это кажется очень полезной штукой потому что в БД может свободно храниться книга и рукописные издания. Например на хостинге “fozzy” на котором размещен данный сайт. Данные выпрыгивают за миллисекунды  Отображение строк 0 - 5 (6 всего, Запрос занял 0.0001 сек.) А встроенный кеш, еще и кеширует весь отобразившийся контент. Что больше чем очень подходит для самописного лендинга или самописного сайта.<p>\r\n<\/div>\r\n\r\n<p>Каждый бросок сюрикена в базу данных, выбрасывает из неё пост. И не просто какой нибудь взятый непонятно где. Или из каких нибудь загадочных источников. НееЕ совсем не так! Выпрыгивать будет пост из личной собственной разработки, из самой настоящей: “веб мастерской имени Барона Сайтоверстаузена”. Таким образом, будет сигнализировать, азбукой морзе: о зашкаливающим, шквале, небывалой улености. С элементами волшебных подхвахтившихся щепоток: Волшебного счастья!<\/p>\r\n<p>Всё! В этом мире ничему удивляться! Даже если Вас случайно собьет единорог, заискрятся звезды, расцветет радуга, а кто нибудь из параллельного измерения будет подкидывать подарки.  И...: “А как Вы хотели?”.<\/p>\r\n\r\n\r\n<p>Поэтому на радостях сказочного настроя. В этот лендинг можно попробовать вставить галерею из ста фотографий, по техники “сингл пейдж апликейшн” и собственно ручным изобретением под все устройства и многоформатной поддержкой. Так что их можно с легкостью открывать: и на андроиде, и на айпеле, и даже на дедушкином телефоне, и даже на древней балалайке бабы Гали из восьмого подъезда! То есть вообще: “Ой, Всё!”.<\/p>\r\n\r\n<p>А что же будет если в подгрузку на html со специальностью “HTML CODER” взять и загрузить в базу данных скрипт костылеи “галереи на костылях”, и … что это?<\/p>\r\n\r\n<p>Пару часов “шаманских плясок с бубном” и адаптивная галерея “Костлея” (как обычная галерея только на костылях) Теперь еще и может называться сингл пейдж с двойной стадии подгрузки. Пока что до конца еще не ясно зачем это может быть нужно, но скрипт адаптивной галереи на костылях - “костылеи”. Можно загружать в базу mySQL и работать с галереей прямо из базы. Единственное что может приунять наплыв страстей - это то, что скрипт из БД, отображается и прекрасно работает, но вот стайл! ... Стиль написанный на CSS частично пропадает. Возможно и другие причины. Но даже если можно подгружать яваскрипт из базы данных с помощью пиашпишки. Все равно остается загадкой зачем это вообще надо…<\/p>\r\n"],["Теория стоимости успешного лендинга.","<p>Если стать самозанятым, а сидеть так же без работы, но только уже с видом занятого, желание не возникает. То сколько можно брать за собственноручный лендинг, ручной работы? Разумно было бы предположить по расчету стоимости и всех затрат что 3900 рублей.<\/p>\r\n      <p>3000 - все формажорные обстоятельства и непредвиденные затраты. Контекстная реклами. + небольшая подушка безопасности на обеспечения 3-х дневной жизни в тайге. ...И 800 рублей за лендинг.(всетаки не бесплатно же работать) Как показывает практика.<\/p>\r\n      <p>+100 - Коту на вискас!<\/p>\r\n<p>За один только дизайн сайта можно запросить космическую цену. Чтобы в этом убедиться. Если оформить заказ на яндекс услугах, по созданию дизайна.<\/p>\r\n\r\n<p>В первую секунду, полетели очень разношерстные цены на дизайн макета. От тысячи рублей и взлетая до парочки троек прожиточных минимумов. Как говорит статистика, о том что в мАскве продают лендинги по миллиону рублей - это еще не придел. И как говорят: “это же рубли”. Сразу становится ясно.<\/p>\r\n\r\n<p>Коммунизм хлестал всех долгое время. И людям было просто нельзя получать за свою работу материальное вознаграждение. Под грифом: “нет коррупции”. Теперь же когда выступают новые правила и модифицированные попытки освободить людей от коммунистического рабства. Пытаются разорвать цепи. Все удивленно переглядываются и дальше продолжают удивляться.<\/p>\r\n\r\n<p>Главный вопрос остается, без ответа! Сколько же может стоять лендинг?\r\nДля этого необходимо взять, тот же самый закон которым принято угрожать, с целью обвинения: “в незаконной трудовой деятельности”. И просчитать точную сумму согласно статистики, которую можно вычесть с помощью логического умозаключения.<\/p>\r\n\r\n<p>Расчет стоимости из нашего великого закона.\r\n<a href=\"https:\/\/www.google.com\/search?q=%D0%BF%D1%80%D0%BE%D0%B6%D0%B8%D1%82%D0%BE%D1%87%D0%BD%D1%8B%D0%B9+%D0%BC%D0%B8%D0%BD%D0%B8%D0%BC%D1%83%D0%BC&sxsrf=ALeKk01mc7HPZVbqXFLfFGPHW4wW1P2YnA%3A1625289527981&ei=N_PfYNm4O6-trgSN8pzIAw&oq=%D0%BF%D1%80%D0%BE%D0%B6%D0%B8%D1%82%D0%BE%D1%87%D0%BD%D1%8B%D0%B9+%D0%BC%D0%B8%D0%BD%D0%B8%D0%BC%D1%83%D0%BC&gs_lcp=Cgdnd3Mtd2l6EAMyBwgAEEcQsAMyBwgAEEcQsAMyBwgAEEcQsAMyBwgAEEcQsAMyBwgAEEcQsAMyBwgAEEcQsAMyBwgAEEcQsAMyBwgAEEcQsAMyBwgAELADEEMyBwgAELADEENKBAhBGABQoFtYiV1glV9oAXACeACAAYYBiAGGAZIBAzAuMZgBAKABAaoBB2d3cy13aXrIAQrAAQE&sclient=gws-wiz&ved=0ahUKEwiZsOOnk8bxAhWvlosKHQ05BzkQ4dUDCA4&uact=5\">Исходя из данных по версии гугла человек должен жить на 12 тыш рублей<\/a>.<\/p>\r\n\r\n<p>Что в переводе по версии <a href=\"https:\/\/www.google.com\/search?q=%D0%BA%D1%83%D1%80%D1%81+%D0%B4%D0%BE%D0%BB%D0%BB%D0%B0%D1%80%D0%B0&oq=%D0%BA%D1%83%D1%80%D1%81+%D0%B4%D0%BE%D0%BB%D0%BB%D0%B0%D1%80%D0%B0&aqs=chrome..69i57j0j0i433j0i67i433l2j0i433l5.2882j1j7&sourceid=chrome&ie=UTF-8\">яндекса на великие доллары будет 160 баксов<\/a>.<\/p>\r\n\r\n<p>Сказать честно на 12 тыш рублей. Даже по своей собственно версии будет сложно. Поэтому пойдем на небольшую хитрость! И приплюсуется к прожиточному минимуму еще прожиточный минимум кота! <a href=\"https:\/\/rodemax.ru\/prozhitochnyj-minimum-dlya-kota.php\">По версии родемакса он составляет 3700 рублей<\/a>. Как гласит народная мудрость: “без кота и жизнь не та”.<\/p>\r\n\r\n<p>Тогда с этими уже ухищренными расчетами: выйдет почти шишнадцать тысяч рублей!\r\nИ на эти деньги можно снять себе собственную комнату примерно за десятку. Где почти пятачину можно спокойно тратить на бичпакеты и вискас. С чистой совестью и благополучным настроем. Продолжаем высчитывать.\r\nС законодательного трудового закона време будет считаться <a href=\"https:\/\/www.google.com\/search?q=%D1%82%D1%80%D1%83%D0%B4%D0%BE%D0%B2%D0%BE%D0%B9+%D0%B7%D0%B0%D0%BA%D0%BE%D0%BD+%D0%BE+%D0%B2%D1%80%D0%B5%D0%BC%D0%B5%D0%BD%D0%B8+%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B&sxsrf=ALeKk02-uSYGpB3bklKOPoJc9Bgk4lP7pg%3A1625290474893&ei=6vbfYMOCNvLjrgS0l7W4Dw&oq=%D1%82%D1%80%D1%83%D0%B4%D0%BE%D0%B2%D0%BE%D0%B9+%D0%B7%D0%B0%D0%BA%D0%BE%D0%BD+%D0%BE+%D0%B2%D1%80%D0%B5%D0%BC%D0%B5%D0%BD%D0%B8+%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B&gs_lcp=Cgdnd3Mtd2l6EAMyCAghEBYQHRAeMggIIRAWEB0QHjoHCAAQRxCwAzoECCMQJzoCCAA6BggAEBYQHjoHCAAQhwIQFDoFCAAQsQNKBAhBGABQj-IBWN-xAmDCswJoAnACeACAAZ0BiAGPJJIBBDAuMziYAQCgAQGqAQdnd3Mtd2l6yAEIwAEB&sclient=gws-wiz&ved=0ahUKEwjDn6brlsbxAhXysYsKHbRLDfcQ4dUDCA4&uact=5\">40 часов в неделю<\/a>\r\nИ самое главное что люди не знают это<a href=\"http:\/\/www.consultant.ru\/document\/cons_doc_LAW_34683\/b25591b628cf4c13d185a767e6c1d04842257a16\/#:~:text=%D0%9F%D0%B5%D1%80%D0%B5%D1%80%D1%8B%D0%B2%D1%8B%20%D0%B4%D0%BB%D1%8F%20%D0%BE%D1%82%D0%B4%D1%8B%D1%85%D0%B0%20%D0%B8%20%D0%BF%D0%B8%D1%82%D0%B0%D0%BD%D0%B8%D1%8F,-%D0%9F%D1%83%D1%82%D0%B5%D0%B2%D0%BE%D0%B4%D0%B8%D1%82%D0%B5%D0%BB%D0%B8%20%D0%BF%D0%BE%20%D0%BA%D0%B0%D0%B4%D1%80%D0%BE%D0%B2%D1%8B%D0%BC&text=%D0%92%20%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%80%D0%B0%D0%B1%D0%BE%D1%87%D0%B5%D0%B3%D0%BE%20%D0%B4%D0%BD%D1%8F%20(%D1%81%D0%BC%D0%B5%D0%BD%D1%8B,%D0%B2%20%D1%80%D0%B0%D0%B1%D0%BE%D1%87%D0%B5%D0%B5%20%D0%B2%D1%80%D0%B5%D0%BC%D1%8F%20%D0%BD%D0%B5%20%D0%B2%D0%BA%D0%BB%D1%8E%D1%87%D0%B0%D0%B5%D1%82%D1%81%D1%8F\">закон удиляет время на обед<\/a>.<\/p>\r\n<p>И это время не должно быть проведено в работе. А если Вы уважаемый персонаж работает 9 часов в день, вместо восьми,< 12тыш, то это можно считать самой настоящей мошеннической схемой и нарушением трудового закона.<\/p>\r\n\r\n<p>Поэтому можно спокойно говорить что \"подпольный коммунизм\" в наше время это сплошное нарушение закона. А скрытый подпольный коммунизм - это еще и криминальная группировка прикрывающаяся законом для своего личного НЕЗАКОННОГО обогащения, по предварительному сговору! Ведь Мы живем в свободной стране, с честными и разумными правилами.<\/p>\r\n<p>И того выходит что лендинг который делается за один день разумно может стоить 16 000 \/ (40*4 недели) = 100 руб в час. 100*8=800 руб. в день  “с учетом содержания кота”.  Что можно посчитать вполне приемлемым. Такие образом стоимость лендинга определенная законом должна составлять 800 кошачих рублей!<\/p>\r\n<p>И никак не меньше! Или кота Вам не жалко!<p>\r\n    \r\n<div class=\"boxFirst\">\r\n        <div class='imagesWindow'>\r\n            <div id=\"news\"><\/div>\r\n        <\/div>\r\n        <div class=\"buttony\">\r\n            <div id=\"leftButton\" style=\"font-size:25px;\">⬅<\/div>\r\n            <div id=\"rightButton\" style=\"font-size:25px;\">➡<\/div>\r\n        <\/div>\r\n    <\/div>\r\n   <p>Вот и всё, логическая цепочка выстраивает тот “необъяснимый но факт” что за модификацию, дополнение, исправление и внесение изменений. По старому ладу можно брать 800 рублей. Что и говорит по статистике на самой знаменитой бирже фрилансеров ценники на доработку php часто оцениваются в 1500 рупий. Что почти тоже самое что и рублей. С одним отличием - рупий на три копейки дороже.<\/p>\r\n<strong>P.S. “Кота своего не забудьте!”<\/strong>\r\n  <style>\r\n.boxFirst{\r\ndisplay:flex;\r\nflex-direction: column;\r\njustify-content: center;\r\nalign-items:center;\r\nmax-width: 100%;\r\n}\r\n#leftButton{\r\ndisplay:flex;\r\nborder:blueviolet solid 2px;\r\n\/* border-radius: 50%; *\/\r\nbackground-color: burlywood;\r\nwidth: 70px;\r\njustify-content: center;\r\nalign-items: center;\r\npadding:10px;\r\n}\r\n#leftButton:hover{\r\nbackground-color: rgb(247, 177, 85);\r\n}\r\n#leftButton:active{\r\nbackground-color: rgb(212, 67, 0);\r\n}\r\n#rightButton{\r\ndisplay:flex;\r\nborder:blueviolet solid 2px;\r\n\/* border-radius: 50%; *\/\r\nbackground-color: burlywood;\r\nwidth: 70px;\r\njustify-content: center;\r\nalign-items: center;\r\npadding:10px;\r\n}\r\n#rightButton:hover{\r\nbackground-color: rgb(247, 177, 85);\r\n}\r\n#rightButton:active{\r\nbackground-color: rgb(212, 67, 0);\r\n}\r\n.buttony{\r\ndisplay: flex;\r\njustify-content: space-around;\r\n\/* text-align: center; *\/\r\nwidth: 100%;\r\nbackground-color: rgb(80, 135, 25);\r\n}\r\n\/* .imagesWindow{\r\ndisplay: flex;\r\nwidth: 100%;\r\nheight: 100%;\r\n\r\nmax-width: 100%;\r\nmax-height: 100%;\r\nbackground-color: rgba(0, 100, 0, 0.144);\r\n} *\/\r\n<\/style>\r\n<script>\r\nif(window.innerWidth<=900){\r\nlet rpoZh=900-window.innerWidth;\r\nlet andE =(900*100)\/window.innerWidth;\r\nconsole.log(rpoZh+\"____\"+andE+'_Prosto andE');\r\nlet height = (600*100)\/(andE);\r\nconsole.log(height+'_proverka height');\r\ndocument.querySelector('.imagesWindow').style.cssText=`\r\ndisplay:flex;\r\nheight: ${height}px;\r\n`;\r\nconsole.log(`${andE}`+'Туту написано из оттдуа');\r\n}else{\r\ndocument.querySelector('.imagesWindow').style.cssText=`\r\ndisplay:flex;\r\nheight:600px;\r\nwidth:900px;\r\n`;\r\n}\r\nlet imgPod = ['lendos-json\/image.html', 'lendos-json\/images1.html','lendos-json\/images2.html','lendos-json\/images3.html','lendos-json\/images4.html'];\r\nlet i=+0;\r\n\r\nif(window.location.hash==\"#1\"){\r\ni=1;\r\nnextImages();\r\n}else if(window.location.hash==\"#2\"){\r\ni=2;\r\nnextImages();\r\n}else if(window.location.hash==\"#3\"){\r\ni=3;\r\nnextImages();\r\n}else if(window.location.hash==\"#4\"){\r\ni=4;\r\nnextImages();\r\n}else if(window.location.hash==\"#5\"){\r\ni=5;\r\nnextImages();\r\n}else{\r\ni=1;\r\n}\r\nfunction nextImages(){\r\nlet podimgl = new XMLHttpRequest();\r\npodimgl.open('GET', `${imgPod[i]}`);\r\npodimgl.send();\r\npodimgl.onload = function(){\r\nif(podimgl.status ==200){\r\nresponseType =\"Text\";\r\ndocument.querySelector('#news').innerHTML = this.response;\r\n}\r\n}\r\n}\r\nnextImages();\r\nlet ow = window.location.href;\r\nconsole.log(ow);\r\nleftButton.addEventListener('click',function(){\r\nif(i){\r\ni--;\r\n\r\nwindow.location='\/blozhik\/blog.php?legal-value-of-the-landing-page#'+[i];\r\nsetTimeout(nextImages(),10);\r\nconsole.log(imgPod);\r\nconsole.log(i);\r\n}else if(i<=0){\r\ni=5;\r\nwindow.location='\/blozhik\/blog.php?legal-value-of-the-landing-page#'+[i];\r\nconsole.log(imgPod);\r\nconsole.log(i);\r\n}else{\r\nwindow.location='\/blozhik\/blog.php?legal-value-of-the-landing-page#'+[i];\r\nsetTimeout(nextImages(),10);\r\nconsole.log('ну незнаю!');\r\n}\r\n});\r\nrightButton.addEventListener('click',function(){\r\nif(i<4){\r\ni++;\r\nwindow.location='\/blozhik\/blog.php?legal-value-of-the-landing-page#'+[i];\r\nsetTimeout(nextImages(),10);\r\nconsole.log(imgPod);\r\nconsole.log(i);\r\n}else if(i==4){\r\ni=0;\r\nwindow.location='\/blozhik\/blog.php?legal-value-of-the-landing-page#'+[i];\r\nsetTimeout(nextImages(),10);\r\nconsole.log(imgPod);\r\nconsole.log(i);\r\n}else{\r\nwindow.location='\/blozhik\/blog.php?legal-value-of-the-landing-page#'+[i];\r\nsetTimeout(nextImages(),10);\r\nconsole.log('ну незнаю2!');\r\nconsole.log(imgPod);\r\nconsole.log(i);\r\n}\r\n});\r\n<\/script>"]]